main/app/Models/LoginModel.php

SELECT *
FROM `auth_logins`
WHERE `id` = (SELECT MAX(`id`) AS `maxId` FROM `auth_logins`)
AND `user_id` = 12
---
    public function getLastActivity(int $userId)
    {
        if (null === $found = cache("{$userId}_logins")) {
            $this->builder()
                ->where('id', $this->builder()->selectMax('id', 'maxId'))
                ->where('user_id', $userId);

            $query = $this->builder->get();