main/app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` IS NULL
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
	public function attemptForgot()
	{
		if ($this->config->activeResetter === null)
		{
			return redirect()->route('login')->with('error', lang('Auth.forgotDisabled'));
		}

		$users = model(UserModel::class);

		$user = $users->where('email', $this->request->getPost('email'))->first();

SELECT *
FROM `users`
WHERE `email` = 'mauriciomacias2.0@gmail.com'
AND `reset_hash` = '0371e38b4894288ac4b45be662987961'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
	public function attemptReset()
	{
		if ($this->config->activeResetter === null)
		{
			return redirect()->route('login')->with('error', lang('Auth.forgotDisabled'));
		}

		$users = model(UserModel::class);

		// First things first - log the reset attempt.
		$users->logResetAttempt(
			$this->request->getPost('email'),
			$this->request->getPost('token'),
			$this->request->getIPAddress(),
			(string)$this->request->getUserAgent()
		);

		$rules = [
			'token'		=> 'required',
			'email'		=> 'required|valid_email',
			'password'	 => 'required|strong_password',
			'pass_confirm' => 'required|matches[password]',
		];

		if (! $this->validate($rules))
		{
			return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
		}

		$user = $users->where('email', $this->request->getPost('email'))
					  ->where('reset_hash', $this->request->getPost('token'))
					  ->first();

UPDATE `users` SET `password_hash` = '$2y$10$cQSA3DeHTgvKPEVH61maoe35afR4DZ0iWndDP38tMTr4t70S7MChe', `reset_hash` = NULL, `reset_at` = '2022-03-01 08:08:27', `reset_expires` = NULL, `force_pass_reset` = 0, `updated_at` = '2022-03-01 08:08:27'
WHERE `users`.`id` IN ('12')
---
		$user->reset_at 		= date('Y-m-d H:i:s');
		$user->reset_expires    = null;
        $user->force_pass_reset = false;
		$users->save($user);

SELECT *
FROM `users`
WHERE `activate_hash` = '1a1dba4633485af18c4429361b127dfa'
AND `active` = 0
AND `users`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `users` SET `activate_hash` = NULL, `active` = 1, `updated_at` = '2022-02-28 22:58:33'
WHERE `users`.`id` IN ('11')
---
	public function activateAccount()
	{
		$users = model(UserModel::class);

		// First things first - log the activation attempt.
		$users->logActivationAttempt(
			$this->request->getGet('token'),
			$this->request->getIPAddress(),
			(string) $this->request->getUserAgent()
		);

		$throttler = service('throttler');

		if ($throttler->check(md5($this->request->getIPAddress()), 2, MINUTE) === false)
        {
			return service('response')->setStatusCode(429)->setBody(lang('Auth.tooManyRequests', [$throttler->getTokentime()]));
        }

		$user = $users->where('activate_hash', $this->request->getGet('token'))
					  ->where('active', 0)
					  ->first();

		if (is_null($user))
		{
			return redirect()->route('login')->with('error', lang('Auth.activationNoUser'));
		}

		$user->activate();

		$users->save($user);